УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаВозвратТоваровОтКлиента/ЗаявкаНаВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаполнятьЦеныЗаменяющихТоваровПоВозвращаемым</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособКомпенсации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВозвратаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ЗаменяющиеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвращаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаВозвратТоваровОтКлиента/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Фролов+
	Если Не (РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеВозвратовТоваровОтКлиентов")) Тогда
		Объект.Статус=?(Объект.Ссылка.Пустая(),Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована,Объект.Статус);
		Элементы.Статус.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивСтатусовОграниченный(Объект.Статус));
		Элементы.Статус.Доступность=Объект.Статус=Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована
									Или Объект.Статус=Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена;
	КонецЕсли;	
	// Фролов-
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 17.05.2021 12:24:07 задача 520
	НовыйРеквизит = Элементы.Добавить("смартСклад", Тип("ПолеФормы"), Элементы.ВозвращаемыеТовары);
	НовыйРеквизит.Заголовок = "Склад";
	НовыйРеквизит.Вид = ВидПоляФормы.ПолеВвода;
	НовыйРеквизит.ПутьКДанным = "Объект.ВозвращаемыеТовары.смартСклад";
	//Смарт }Подкин Алексей Иванович 17.05.2021 12:24:07
	
	//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма, "ВозвращаемыеТовары", "ВозвращаемыеТоварыНоменклатура", "Объект.ВозвращаемыеТовары.Номенклатура");
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	Элементы.ВозвращаемыеТовары.УстановитьДействие("ПриИзменении", "смартТоварыПриИзменении");
	//-- #Б6826 смарт: Шляпников 23.06.2026
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПартнерПриИзменении")
Процедура смарт_ПартнерПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		УстановитьВидимостьЗапретаОтгрузкиПартнеру();
		Возврат;
	КонецЕсли;

	ПартнерПриИзмененииСервер();

	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
	КонецЕсли;

	#Вставка
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначенияКлиент.УстановитьОтображениеПризнакаВИП(ЭтаФорма, Объект.Партнер);
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_ЗаявкаНаВозвратТоваровОтКлиента", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #Б6948 смарт: Шляпников 11.06.2026 / Маркировка. Алгоритм действий системы и БП при заказе нового товара при наличии остатков на складах.
	смартМаркировкаКлиент.ВывестиСообщениеОБудущейМаркировкеНоменклатурыПоДокументу(Объект);
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6948 смарт: Шляпников 11.06.2026
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
&НаСервереБезКонтекста
Функция ПолучитьМассивСтатусовОграниченный(УстановленныСтатус)
	Список=Новый Массив;
	Список.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована);
	Список.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена);
	Если Список.Найти(УстановленныСтатус)=Неопределено Тогда 
		Список.Вставить(1,УстановленныСтатус);
	КонецЕсли;
	Возврат Список;
КонецФункции

// ++ Смарт: Белоусова 499 29.04.2021
&НаКлиенте
Процедура смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	п = смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПослеНаСервере() ;
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",п,элемент);
	
КонецПроцедуры

// ++ Смарт: Белоусова 499 29.04.2021
&НаСервере
функция смарт_ВозвращаемыеТоварыНоменклатураНачалоВыбораПослеНаСервере()
	группа1 = перечисления.ТипыНоменклатуры.Услуга;
	отбор1 = новый структура;
	отбор1.Вставить("ТипНоменклатуры",группа1);
	
	группа2 = перечисления.ТипыНоменклатуры.Товар;
	отбор2 = новый структура;
	отбор2.Вставить("ТипНоменклатуры",группа2);
	
	группа3 = перечисления.ТипыНоменклатуры.МногооборотнаяТара;
	отбор3 = новый структура;
	отбор3.Вставить("ТипНоменклатуры",группа2);

	п = новый структура;                       
	п.Вставить("Отбор1",отбор1);
	п.Вставить("Отбор2",отбор2);
	п.Вставить("Отбор3",отбор3);
	возврат п;
КонецФункции

//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
&НаКлиенте
Процедура смартЗаполнитьСтатусыУказанияСерийВСтроке()
	
	ЭлементВозвращаемыеТовары = Элементы.ВозвращаемыеТовары;
	
	ТекущиеДанные 			   = ЭлементВозвращаемыеТовары.ТекущиеДанные;
	ТекущаяСтрокаИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		
	ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ТекущаяСтрокаИдентификатор, КэшированныеЗначения, "Возвращаемые");	
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(ЭлементВозвращаемыеТовары, КэшированныеЗначения, ПараметрыУказанияСерий.Возвращаемые);

КонецПроцедуры //--#1775 смарт: Лопато 12.04.2024					

//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.ВозвращаемыеТовары);
	
КонецПроцедуры

//++ #Б6826 смарт: Шляпников 23.06.2026 / Маркировка. Возврат товара / Корректировка реализации в 1С УТ РФ. Реализация механизма.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

#КонецОбласти
